_site/org/colloquium/clojure.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="sr" xml:lang="sr">
<head>
<!-- 2017-05-15 пон 20:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Napredne tehnike programiranja - kolokvijumi Clojure</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Novak Boškov" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Napredne tehnike programiranja - kolokvijumi Clojure</h1>
<div id="table-of-contents">
<h2>Sadr&#382;aj</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org62cc966">1. Maj 2017.</a>
<ul>
<li><a href="#orgf44c2a8">1.1. <i>Kizomba</i></a>
<ul>
<li><a href="#org0c4a566">1.1.1. Precrtajte tvrdnje koje smatrate netačnim, zaokružite one koje smatrate tačnim. Navedite zašto.</a></li>
<li><a href="#org6972a2a">1.1.2. Objasnite koncept homoikoničnosti i dajte jedan primer koji ga oslikava.</a></li>
<li><a href="#org83b6885">1.1.3. Objasnite koncept kompozicije funkcija i dajte jedan primer koji ga oslikava.</a></li>
<li><a href="#org3eb6c78">1.1.4. Šta su reference (<code>refs</code>) u Clojure i čemu služe?</a></li>
<li><a href="#org49fee64">1.1.5. Napišite makro <code>defatom</code>.</a></li>
</ul>
</li>
<li><a href="#orge77bd43">1.2. <i>Eskista</i></a>
<ul>
<li><a href="#org929cb69">1.2.1. Precrtajte tvrdnje koje smatrate netačnim, zaokružite one koje smatrate tačnim. Navedite zašto.</a></li>
<li><a href="#org5c86fa4">1.2.2. Objasnite koncept referencijalne transparentnosti i dajte jedan primer koji ga oslikava.</a></li>
<li><a href="#org7d901a9">1.2.3. Objasnite koncept lenjih sekvenci i dajte jedan primer koji ga oslikava.</a></li>
<li><a href="#org6a4891d">1.2.4. Šta su atomi (<code>atoms</code>) u Clojure i čemu služe?</a></li>
<li><a href="#org1e44ad2">1.2.5. Napišite makro <code>print-ref</code>.</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org62cc966" class="outline-2">
<h2 id="org62cc966"><span class="section-number-2">1</span> Maj 2017.</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgf44c2a8" class="outline-3">
<h3 id="orgf44c2a8"><span class="section-number-3">1.1</span> <i>Kizomba</i></h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-org0c4a566" class="outline-4">
<h4 id="org0c4a566"><span class="section-number-4">1.1.1</span> Precrtajte tvrdnje koje smatrate netačnim, zaokružite one koje smatrate tačnim. Navedite zašto.</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Tačne tvrdnje su obeležene sa:
</p>
<ul class="org-ul">
<li class="on"><code>[X]</code> </li>
</ul>
<p>
a netačne sa:
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> </li>
</ul>
<hr />

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <p>
Funkcionalno programiranje je paradigma programiranja koja
se zasniva na pisanju naredbi koje menjaju stanje objekata u
memoriji.
</p>

<p>
Ne, naprotiv. Funkcionalno programiranje se orijentiše na izraze
a ne na naredbe, koncept stanja se obično predstavlja serijom
imutabilnih vrednosti. Funkcionalni dizajn programa se bavi
stvarima kao što su čiste funkcije i njihova orkestracija.
</p></li>

<li class="off"><code>[&#xa0;]</code> <p>
Funkcionalno programiranje daje najbolje alate za pristup i
upravljanje memorijskim lokacijama.
</p>

<p>
Ne, funkcionalno programiranje je ujedno i deklerativno te stoga
na upravljanje memorijom obično gleda kao na detalje
implementacije pre nego dizajn. Upravljanje memorijom je obično
van dohvata programera koji piše program u funckionalnom
programskom jeziku.
</p></li>

<li class="off"><code>[&#xa0;]</code> <p>
U funkcionalnom programiranju programer treba da gleda na
entitete programa kao na logičke celine koje menjaju svoje
stanje odgovarajući na dešavanja u programu.
</p>

<p>
U funkcionalnom programiranju programer treba da gleda na
problem tako što ga dekomponuje na čiste funkcije (i pametetno
odredi tipove). Gore opisano ponašanje više odgovara objektnom
programiranju.
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org6972a2a" class="outline-4">
<h4 id="org6972a2a"><span class="section-number-4">1.1.2</span> Objasnite koncept homoikoničnosti i dajte jedan primer koji ga oslikava.</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Homoikoničnost je osobina programskog jezika ili programa koja
govori o tome da se sintaksa predstavlja validnim programskim
konstrukcijama (strukturama podataka). Na taj način pomoću
homoikoničnosti može menjati struktura programa iz samog programa.
</p>

<p>
U Clojure-u je npr:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">a</span> 1<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Istovremeno i lista od 3 simbola i njome možete baratati na
standardan način kao i sa listom:
</p>

<div class="org-src-container">
<pre class="src src-clojure">'<span style="color: #DCDCCC;">(</span>1 2 3<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #DCDCCC;">(</span>type '<span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">a</span> 1<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">=&gt; clojure.lang.PersistentList</span>

<span style="color: #DCDCCC;">(</span>= <span style="color: #BFEBBF;">(</span>type '<span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">a</span> 1<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
   <span style="color: #BFEBBF;">(</span>type '<span style="color: #D0BF8F;">(</span>1 2 3<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">=&gt; true</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org83b6885" class="outline-4">
<h4 id="org83b6885"><span class="section-number-4">1.1.3</span> Objasnite koncept kompozicije funkcija i dajte jedan primer koji ga oslikava.</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Kompozicija funkcija je primena funkcije na povratnu vrednost neke
druge funkcije kako bi se napravila treća.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">f3</span> <span style="color: #BFEBBF;">(</span>comp - *<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>f3 2 3<span style="color: #DCDCCC;">)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">=&gt; -6</span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">f3</span> <span style="color: #BFEBBF;">[</span>a b<span style="color: #BFEBBF;">]</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">-&gt;</span> <span style="color: #D0BF8F;">(</span>* a b<span style="color: #D0BF8F;">)</span>
      -<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>f3 2 3<span style="color: #DCDCCC;">)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">=&gt; -6</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3eb6c78" class="outline-4">
<h4 id="org3eb6c78"><span class="section-number-4">1.1.4</span> Šta su reference (<code>refs</code>) u Clojure i čemu služe?</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
Koncept reference (<code>ref</code>) u okruženju gde imamo više tokova
izvršavanja (<i>thread</i>-ova) omogućuje sinhronizovan, koordinisan
pristup mnoštvu identiteta korišćenjem softverske transakcione
memorije.
</p>
</div>
</div>

<div id="outline-container-org49fee64" class="outline-4">
<h4 id="org49fee64"><span class="section-number-4">1.1.5</span> Napišite makro <code>defatom</code>.</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
<code>defatom</code> se koristi ovako:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defatom</span> <span style="color: #93E0E3;">moj-atom</span> <span style="color: #BFEBBF;">{</span><span style="color: #BFEBBF;">:a</span> 1<span style="color: #BFEBBF;">}</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
a ima isti efekat kao da smo napisali:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">moj-atom</span> <span style="color: #BFEBBF;">(</span>atom <span style="color: #D0BF8F;">{</span><span style="color: #BFEBBF;">:a</span> 1<span style="color: #D0BF8F;">}</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Rešenje:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defmacro</span> <span style="color: #93E0E3;">defatom</span>
  <span style="color: #BFEBBF;">[</span>s form<span style="color: #BFEBBF;">]</span>
  `<span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">def</span> ~s <span style="color: #D0BF8F;">(</span>atom ~form<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge77bd43" class="outline-3">
<h3 id="orge77bd43"><span class="section-number-3">1.2</span> <i>Eskista</i></h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-org929cb69" class="outline-4">
<h4 id="org929cb69"><span class="section-number-4">1.2.1</span> Precrtajte tvrdnje koje smatrate netačnim, zaokružite one koje smatrate tačnim. Navedite zašto.</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Tačne tvrdnje su obeležene sa:
</p>
<ul class="org-ul">
<li class="on"><code>[X]</code> </li>
</ul>
<p>
a netačne sa:
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> </li>
</ul>
<hr />

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <p>
Funkcionalno programiranje je inspirisano <i>Von Neumann</i>-ovom
arhitekturom računara.
</p>

<p>
Ne, funkcionalno programiranje je koncipirano nezavisno od <i>Von
Neumann</i>-ove arhitekture.
</p></li>

<li class="off"><code>[&#xa0;]</code> <p>
Funkcionalno programiranje po svojoj postavci unosi novu
kompleksnost u konkurentno/paralelno programiranje.
</p>

<p>
Ne, s obzirom da naglašava imutabilne strukture podataka i čiste
funkcije predstavlja dobru podlogu za konkurentno programiranje.
</p></li>

<li class="on"><code>[X]</code> Funkcionalno programiranje promoviše rekurzivan način
razmišljanja i dizajn.</li>
</ul>
</div>
</div>

<div id="outline-container-org5c86fa4" class="outline-4">
<h4 id="org5c86fa4"><span class="section-number-4">1.2.2</span> Objasnite koncept referencijalne transparentnosti i dajte jedan primer koji ga oslikava.</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Za funkcije koje za iste parametre uvek daju iste rezultate kažemo
da su referencijalno transparentne. Funkcije u matematici su
referencijalno transparentne. U Clojure-u je npr. funckija <code>conj</code>
referencijalno transparenta:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">a</span> <span style="color: #BFEBBF;">[</span>1 2 3<span style="color: #BFEBBF;">]</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>= <span style="color: #BFEBBF;">(</span>conj a 4<span style="color: #BFEBBF;">)</span>
   <span style="color: #BFEBBF;">(</span>conj a 4<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">=&gt; true</span>
</pre>
</div>

<p>
Ali funkcija <code>swap!</code> nije:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">a</span> <span style="color: #BFEBBF;">(</span>atom <span style="color: #D0BF8F;">[</span>1 2 3<span style="color: #D0BF8F;">]</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span>= <span style="color: #BFEBBF;">(</span>swap! a conj 4<span style="color: #BFEBBF;">)</span>
   <span style="color: #BFEBBF;">(</span>swap! a conj 4<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">=&gt; false</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d901a9" class="outline-4">
<h4 id="org7d901a9"><span class="section-number-4">1.2.3</span> Objasnite koncept lenjih sekvenci i dajte jedan primer koji ga oslikava.</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Lenje sekvence su sekvence koje ne evaluiraju svoje elemente do
momenta kada su one neophodne. Svoje elemente reačunaju "na
zahtev". Većina Clojure funkcija vraća lenje sekvence. Takve su i
<code>range</code> i <code>concat</code>:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">a</span> <span style="color: #BFEBBF;">(</span>concat <span style="color: #D0BF8F;">[</span>1 2 3<span style="color: #D0BF8F;">]</span> <span style="color: #D0BF8F;">(</span>range 100000000<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Izraz gore će se izvršiti odmah. Neće se trošiti vreme ni za
pravljenje <i>range</i>-a ni za njegovu konkatenaciju sa <code>[1 2
    3]</code>. Svaki element u <code>a</code> će se računati tek kada/ako bude
potreban.
</p>

<p>
Primetimo da sledeći izraz u Python-u 3 troši vreme i ne izvršava
se odmah.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">a</span> = [1, 2, 3] + <span style="color: #DCDCCC; font-weight: bold;">list</span>(<span style="color: #DCDCCC; font-weight: bold;">range</span>(100000000))
</pre>
</div>

<p>
Iako se pravljenje <i>range</i>-a izvršava odmah:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">a</span> = <span style="color: #DCDCCC; font-weight: bold;">range</span>(100000000)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6a4891d" class="outline-4">
<h4 id="org6a4891d"><span class="section-number-4">1.2.4</span> Šta su atomi (<code>atoms</code>) u Clojure i čemu služe?</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
Atomi su koncept koji služi za rad sa entitetima kojima je
potrebno obezbediti sinhrono, nekoordinisano, nezavisno
pristupanje u okruženju gde imamo više alternativnih tokova
izvršavanja &#x2014; <i>thread</i>-ova. Atomi nam daju <i>thread safe</i>
mehanizam za rad sa takvim entitetima.
</p>
</div>
</div>

<div id="outline-container-org1e44ad2" class="outline-4">
<h4 id="org1e44ad2"><span class="section-number-4">1.2.5</span> Napišite makro <code>print-ref</code>.</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
<code>print-ref</code> se koristi ovako:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">moja-referenca</span> <span style="color: #BFEBBF;">(</span>ref <span style="color: #D0BF8F;">{</span><span style="color: #BFEBBF;">:m</span> 2<span style="color: #D0BF8F;">}</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DCDCCC;">(</span>print-ref moja-referenca<span style="color: #DCDCCC;">)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">=&gt; referenca sa trenutnom vrednoscu  {</span><span style="color: #7F9F7F;">:m</span><span style="color: #7F9F7F;"> 2}</span>
</pre>
</div>

<p>
a ima isti efekat kao:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #DCDCCC;">(</span>println <span style="color: #CC9393;">"referenca sa trenutnom vrednoscu "</span> <span style="color: #BFEBBF;">(</span>deref moja-referenca<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Rešenje:
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defmacro</span> <span style="color: #93E0E3;">print-ref</span>
  <span style="color: #BFEBBF;">[</span>r<span style="color: #BFEBBF;">]</span>
  `<span style="color: #BFEBBF;">(</span>println <span style="color: #CC9393;">"referenca sa trenutnom vrednoscu "</span> <span style="color: #D0BF8F;">(</span>deref ~r<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Novak Boškov</p>
<p class="date">Created: 2017-05-15 пон 20:29</p>
<p class="validation"></p>
</div>
</body>
</html>
